# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Boas Práticas para Experimentos Computacionais em Clusters de Alto Desempenho
#+AUTHOR: Lucas Mello Schnorr\footnote{Lucas Mello Schnorr possui graduação em Ciência da Computação pela Universidade Federal de Santa Maria (2003), mestrado em Computação pela Universidade Federal do Rio Grande do Sul (2005), doutorado em Computação pela Universidade Federal do Rio Grande do Sul com um acordo de cotutela com o Institut National Polytechnique de Grenoble (2009), pós-doutorado pelo Centre National de la Recherche Scientifique (2011) e pós-doutorado pelo Institut National de Recherche en Informatique et en Automatique (2017). Desde 2013 é Professor Adjunto da Universidade Federal do Rio Grande do Sul e orientador do Programa de Pós-Graduação em Computação. Conduz pesquisas em ambiente internacional. Tem experiência na área da Computação, com ênfase em Sistemas de Computação e Processamento de Alto Desempenho.}, Vinícius Garcia Pinto\footnote{Vinícius Garcia Pinto  possui graduação em Ciência da Computação pela Universidade Federal de Santa Maria (2010), mestrado em Computação pelo Universidade Federal do Rio Grande do Sul (2013) e doutorado em Computação pela Universidade Federal do Rio Grande do Sul em cotutela com a Université Grenoble Alpes / França (2018). Foi professor da Faculdade São Francisco de Assis e da Universidade de Caxias do Sul. Tem experiência em Programação Paralela e Computação de Alto Desempenho} @@latex:\\@@ \emph{Instituto de Informática, Universidade Federal do Rio Grande do Sul \\Porto Alegre, Brasil}

#+STARTUP: overview indent
#+LANGUAGE: pt_BR
#+OPTIONS: H:3 creator:nil timestamp:nil skip:nil toc:nil num:t ^:nil ~:~
#+OPTIONS: author:true title:true date:nil
#+TAGS: noexport(n) deprecated(d) ignore(i)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+LATEX_CLASS: SBCbookchapter
#+LATEX_CLASS_OPTIONS: [12pt]
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
*** Programação Literária
<<literateProg>>

A Programação Literária proposta por Donald Knuth \cite{Knuth1984} tem
por base duas operações (/weave/ e /tangle/) que permitem converter um
documento fonte em duas representações distintas, um formato legível
para humanos e outro apto para execução em computadores. Esta
funcionalidade é bastante útil na análise de resultados experimentais
pois permite manter em um mesmo documento tanto as anotações
preliminares como expectativas, suposições e reflexões acerca do
experimento quanto os comandos usados para colocá-lo em execução e
posteriormente processar e visualizar seus resultados.

A extensão Org-mode \cite{Dominik:2010:OMR:1952135} do editor de texto
Emacs \cite{emacsManual} oferece, entre outros recursos,
funcionalidades de programação literária. Arquivos criados com esta
extensão (arquivos ~org~) são arquivos em texto puro que podem ser
abertos e lidos em qualquer editor de texto, embora seja conveniente o
uso do editor Emacs para aproveitamento de todas as funcionalidades. O
pacote ~Babel~ possibilita a definição de blocos ativos de código e de
dados dentro de documentos ~org~, tais blocos podem ser avaliados e a
saída correspondente é capturada e incluída no documento. Os blocos
podem ser escritos em diferentes linguagens de programação, e podem
ser encadeados de forma que os dados de saída produzidos por um bloco
sejam usados como entrada de outro.  Os trechos de código abaixo
ilustram o comportamento desta funcionalidade. O bloco a seguir é
escrito em ~shell script~, com a possível saída produzida representa na
tabela abaixo.

#+name: ex1Shell
#+ATTR_LATEX: :options frame=single, basicstyle=\ttfamily\small, keywordstyle=\bfseries, showstringspaces=false
#+begin_src bash :results value :exports both :cache yes :eval no-export
for n in `seq 5`; do printf "%d $RANDOM \n" $n ; done
#+end_src

#+CAPTION: Possível saída produzida pelo trecho de código em ~shell script~
#+LABEL: tabShell
#+RESULTS[54e71c5a9f735d7fa884f5cb2f683a386dabb7ef]: ex1Shell
| 1 | 21020 |
| 2 | 20873 |
| 3 |  7597 |
| 4 | 19882 |
| 5 | 30785 |

A avaliação do trecho de código acima produzirá uma saída, que será
encadeada como entrada do código abaixo escrito na linguagem R. Quando
avaliado, o código abaixo produzirá como saída, uma imagem contendo um
gráfico construído a partir dos dados gerados pelo primeiro trecho de
código.

#+name: ex2R
#+ATTR_LATEX: :options frame=single, basicstyle=\ttfamily\small, keywordstyle=\bfseries, showstringspaces=false
#+begin_src R :results output graphics :file example-literate.pdf :exports both :width 6 :height 2 :session *R* :var dados=ex1Shell :eval no-export
library(ggplot2)
library(tidyverse)
dados %>%
    ggplot(aes(V1, V2)) +
    geom_point() +
    theme_bw()
#+end_src

#+CAPTION: Gráfico gerado pelo código ~R~ utilizando a saída do código ~shell~ como entrada
#+LABEL: exampleLiterate
#+ATTR_LATEX: :width 0.95\linewidth
#+RESULTS: ex2R
[[file:example-literate.pdf]]

Um mesmo conjunto de dados pode ser usado inúmeras vezes como entrada
para blocos de código diversos. Além do gráfico da Figura
[[exampleLiterate]], podemos usar os dados da Tabela [[tabShell]] para
calcular valores estatísticos como mínimo, máximo, média, mediana e
quartis. O trecho de código abaixo ilustra o comando em R que permite
a obtenção destas informações.

#+begin_src R :results output :exports both :session *R* :eval no-export
dados$V2 %>% summary()
#+end_src

#+RESULTS:
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:    7597   19882   20873   20031   21020   30785

# - Programação literal para análise dos resultados
#   - OrgMode + R
#   - Geração de gráficos (/checklist for good graphics/)

A programação literária, por si só, já é uma prática aconselhada para
facilitar o registro e análise de resultados. Entretanto, ela não
garante que os gráficos gerados na análise em questão sejam claros e
diretos. O resultado do processo de criação de gráficos pode ser
aprimorado com a aplicação de alguns passos de verificação e controle
\cite{jain1991art, schnorrvincentLPS} apresentados na Tabela
[[tab:checklist]].

#+LABEL: tab:checklist
#+CAPTION: /Checklist/ para gráficos
#+ATTR_LATEX: :booktabs :environment longtable :align p{2.1cm}lp{11cm}
| <l>              | <l> | <l>                                                                                                                          |
|------------------+-----+------------------------------------------------------------------------------------------------------------------------------|
| *Dados*            | \check   | O tipo do gráfico é adequado para a natureza do dado (curva, barras, setores, histograma, nuvem de pontos, etc)        |
|                  | \check   | As aproximações/interpolações fazem sentido                                                                                  |
|                  | \check   | As curvas são definidas com um número suficiente de pontos                                                                   |
|                  | \check   | O método de construção da curva é claro: interpolação (linear, polinomial, regressão, etc)                                   |
|                  | \check   | Os intervalos de confiança são visualizados (ou informados separadamente)                                                    |
|                  | \check   | Os passos do histograma são adequados                                                                                        |
|                  | \check   | Histogramas visualizam probabilidades (de 0 a 1)                                                                             |
|------------------+-----+------------------------------------------------------------------------------------------------------------------------------|
| *Objetos Gráficos* | \check   | Os objetos gráficos são legíveis na tela, na versão impressa (P&B), em vídeo, etc                                            |
|                  | \check   | O intervalo do gráfico é padrão, sem cores muito similares, sem verde (vídeo)                                                |
|                  | \check   | Os eixos do gráfico estão claramente identificados e rotulados                                                               |
|                  | \check   | Escalas e unidades estão explícitas                                                                                          |
|                  | \check   | As curvas se cruzam sem ambiguidade                                                                                          |
|                  | \check   | As grades ajudam o leitor                                                                                                    |
|------------------+-----+------------------------------------------------------------------------------------------------------------------------------|
| *Anotações*        | \check   | Eixos são rotulados por quantidades                                                                                          |
|                  | \check   | Rótulos dos eixos são claros e autocontidos                                                                                  |
|                  | \check   | Unidades estão indicadas nos eixos                                                                                           |
|                  | \check   | Eixos são orientados da esquerda para a direita e de baixo para cima                                                         |
|                  | \check   | Origem é (0,0), caso contrário deve estar claramente justificada                                                             |
|                  | \check   | Sem buracos nos eixos                                                                                                        |
|------------------+-----+------------------------------------------------------------------------------------------------------------------------------|
| *Anotações (2)*    | \check   | Para gráficos de barras/histogramas a ordem das barras segue a ordenação clássica (alfabética, temporal, do melhor pro pior) |
|                  | \check   | Cada curva tem uma legenda                                                                                                   |
|                  | \check   | Cada barra tem uma legenda                                                                                                   |
|------------------+-----+------------------------------------------------------------------------------------------------------------------------------|
| *Informação*       | \check   | Curvas estão na mesma escala                                                                                                 |
|                  | \check   | O número de curvas em um mesmo gráfico é pequeno (menor que 6)                                                               |
|                  | \check   | Compare as curvas no mesmo gráfico                                                                                           |
|                  | \check   | Uma curva não pode ser removida sem redução de informação                                                                    |
|                  | \check   | O gráfico fornece informações relevantes ao leitor                                                                           |
|                  | \check   | Se o eixo vertical mostra médias, as barras de erro devem estar presentes                                                    |
|                  | \check   | Não é possível remover qualquer objeto sem modificar a legibilidade do gráfico                                               |
|------------------+-----+------------------------------------------------------------------------------------------------------------------------------|
| *Contexto*         | \check   | Todos os símbolos são definidos e referenciados no texto                                                                     |
|                  | \check   | O gráfico produz mais informação que qualquer outra representação (escolha da variável)                                      |
|                  | \check   | O gráfico tem um título                                                                                                      |
|                  | \check   | O título é suficientemente autocontido para a compreensão parcial do gráfico                                                 |
|                  | \check   | O gráfico é referenciado no texto                                                                                            |
|                  | \check   | O texto comenta a figura                                                                                                     |
|------------------+-----+------------------------------------------------------------------------------------------------------------------------------|
|                  | \check   | *A representação gráfica deve ser elegante*                                                                                    |
|------------------+-----+------------------------------------------------------------------------------------------------------------------------------|

Ao aplicarmos as orientações da Tabela [[tab:checklist]] à Figura
[[exampleLiterate]], notamos que o gráfico em questão pode ser
aprimorado. Inicialmente, devemos adicionar rótulos aos eixos vertical
e horizontal. Dada a natureza dos dados não há unidades a serem
indicadas nos mesmos. Em seguida, adicionamos um título ao gráfico, e
por fim verificamos que a origem deve ser o ponto (0,1) e não (0,0)
pois as observações foram numeradas a partir de 1. O código R abaixo
produz a Figura [[exampleLiterate2]] que contém a versão aprimorada do
gráfico.

#+name: ex3R
#+begin_src R :results output graphics :file example-literate2.pdf :exports both :width 6 :height 2 :session *R*  :eval no-export
library(ggplot2)
library(tidyverse)

dados %>%
    ggplot(aes(V1, V2)) +
    theme_bw() +
    geom_point() +
    ylab("Valor Aleatório") +
    xlab("Observação") +
    ggtitle("Geração de Números Aleatórios em shell script") + 
    lims(y = c(0, NA), x = c(1, NA))
#+end_src

#+CAPTION: Gráfico gerado pelo código ~R~ utilizando a saída do código ~shell~ como entrada (versão aprimorada)
#+LABEL: exampleLiterate2
#+RESULTS: ex3R
[[file:example-literate2.pdf]]


